
R5#config ter
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#int s1/1
R5(config-if)#ip add 15.20.20.5 255.255.255.0
R5(config-if)#no shut
R5(config-if)#exit
*Mar  1 00:03:00.535: %LINK-3-UPDOWN: Interface Serial1/1, changed state to up
*Mar  1 00:03:01.535: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/1, changed state to up
R5(config-if)#exit
R5(config)#int s1/0
R5(config-if)#ip add 35.20.20.5 255.255.255.0
R5(config-if)#no shut
R5(config-if)#exit
*Mar  1 00:03:21.579: %LINK-3-UPDOWN: Interface Serial1/0, changed state to up
R5(config-if)#exit
*Mar  1 00:03:22.583: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up
R5(config-if)#exit
R5(config)#int loopback 0
R5(config-if)#ip add 5.20.0.5 255.255.255.0
R5(config-if)#exit
R5(config)#show ip int brief
             ^
% Invalid input detected at '^' marker.

R5(config)#exit
R5#show ip i
*Mar  1 00:04:09.151: %SYS-5-CONFIG_I: Configured from console by console
R5#show ip int brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
Serial0/0                  unassigned      YES unset  administratively down down
FastEthernet0/1            unassigned      YES unset  administratively down down
Serial0/1                  unassigned      YES unset  administratively down down
Serial0/2                  unassigned      YES unset  administratively down down
Serial0/3                  unassigned      YES unset  administratively down down
Serial1/0                  35.20.20.5      YES manual up                    up
Serial1/1                  15.20.20.5      YES manual up                    up
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
Loopback0                  5.20.0.5        YES manual up                    up
R5#con ter
% Ambiguous command:  "con ter"
R5#config ter
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#ip route 4.20.0.0 255.255.255.0 123.20.20.1
R5(config)#ip route 5.20.0.0 255.255.255.0 5.20.0.5
%Invalid next hop address (it's this router)
R5(config)#ip route 24.20.20.0 255.255.255.0 123.20.20.1
R5(config)#exit
R5#
*Mar  1 00:09:35.979: %SYS-5-CONFIG_I: Configured from console by console
R5#
R5#ping 4.20.0.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.20.0.4, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R5#ping 123.20.20.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 123.20.20.2, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R5#config ter
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#ip route 123.20.20.0 255.255.255.0 35.20.20.3
R5(config)#exit
R5#ping
*Mar  1 00:18:49.551: %SYS-5-CONFIG_I: Configured from console by console
R5#ping 123.20.20.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 123.20.20.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 48/67/96 ms
R5#ping 4.20.0.4

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.20.0.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 68/183/564 ms
R5#
R5#